# import sys
# sys.stdin = open('input.txt')

N, M = map(int, input().split())
arr = [list(map(int, input().split())) for _ in range(N)]
# 테트로미노 회전, 대칭으로 나올 수 있는 모든 종류
tetromino_lst = [
    [(0,0), (0,1), (0,2), (0,3)],
    [(0,0), (1,0), (2,0), (3,0)],
    [(0,0), (0,1), (1,0), (1,1)],
    [(0,0), (0,1), (0,2), (1,0)],
    [(1,0), (1,1), (1,2), (0,2)],
    [(0,0), (1,0), (1,1), (1,2)],
    [(0,0), (0,1), (0,2), (1,2)],
    [(0,0), (1,0), (2,0), (2,1)],
    [(2,0), (2,1), (1,1), (0,1)],
    [(0,0), (0,1), (1,0), (2,0)],
    [(0,0), (0,1), (1,1), (2,1)],
    [(0,0), (0,1), (0,2), (1,1)],
    [(1,0), (1,1), (1,2), (0,1)],
    [(0,0), (1,0), (2,0), (1,1)],
    [(1,0), (0,1), (1,1), (2,1)],
    [(1,0), (2,0), (0,1), (1,1)],
    [(0,0), (1,0), (1,1), (2,1)],
    [(1,0), (0,1), (1,1), (0,2)],
    [(0,0), (0,1), (1,1), (1,2)]
]
max_v = 0
# 완전탐색으로 모든 점에서 테트로미노 별 합을 구하고 최대값과 비교
for x in range(N):
    for y in range(M):
        for tetromino in tetromino_lst:
            sum_v = 0
            for dx, dy in tetromino:
                nx, ny = x + dx, y + dy
                if 0 <= nx < N and 0 <= ny < M:
                    sum_v += arr[nx][ny]
            if sum_v > max_v:
                max_v = sum_v
print(max_v)


